// $Id: e2a.cxx 11394 2005-04-03 08:30:29Z jz $

#include "precomp.h"
//#define MODULE_NAME "e2a"
// e2a.cpp


using namespace std;
namespace sos {


#if defined SYSTEM_DOS

#define x '®'

char e2a_printable [256] = {
  '˙', x , x , x , x , x , x , x , x , x , x , x , x , x , x , x ,
   x , x , x , x , x , x , x , x , x , x , x , x , x , x , x , x ,
   x , x , x , x , x , x , x , x , x , x , x , x , x , x , x , x ,
   x , x , x , x , x , x , x , x , x , x , x , x , x , x , x , x ,

  ' ',' ','É','Ñ','Ö','†','a','Ü','á','§', '`','.','<','(','+','|',
  '&','Ç','à','â','ä','°','å','ã','ç','·', '!','$','*',')',';', x ,
  '-','/','A','é','A','A','A','è','C','•', '^',',','%','_','>','?',
  'Ì','ê','E','E','E','I','I','I','I','"', ':','#','@','\'','=','"',

  'Ì','a','b','c','d','e','f','g','h','i', 'Æ','Ø', x ,'y', x ,'Ò',
  '¯','j','k','l','m','n','o','p','q','r', '¶','ß','ë',',','í', x ,
  'Ê', x ,'s','t','u','v','w','x','y','z',  x ,'®','D','Y', x , x ,
  'õ','ú','ù','˘', x ,'', x ,'¨','´', x , '™','[','\\',']','\'','x',

  'ó','A','B','C','D','E','F','G','H','I',  x ,'ì','î','ï','¢', x ,
  '|','J','K','L','M','N','O','P','Q','R',  x ,'ñ','Å','U','£','ò',
  'U','ˆ','S','T','U','V','W','X','Y','Z', '˝','O','ô','O','O','O',
  '0','1','2','3','4','5','6','7','8','9',  x ,'{','ö','}','U','~'

};

#else

   // siehe ebc2iso.cxx

#endif

} //namespace sos
