       10 TABLE-QUALIFIER PIC X(8).
       10 TABLE-OWNER     PIC X(8).
       10 TABLE-NAME      PIC X(20).
       10 TABLE-TYPE      PIC X(10).
       10 REMARKS         PIC X(80).
       10 FILE            PIC X(200).
       10 LOCAL           PIC 9.
       10 TYPE            PIC X(200).
       10 TYPE-KIND       PIC X(5).
       10 TYPE-LOCAL      PIC 9.

